SET client_encoding = 'UTF8';

-- =====================================================================
-- テスト用マスタデータ
-- 対象テーブル:
--   department
--
-- 前提:
--   schema.sqlを先に実行すること。
-- =====================================================================

BEGIN;

-- ---------------------------------------------------------------------
-- 部署
-- ---------------------------------------------------------------------
DELETE FROM department;
INSERT INTO department (
    department_id,
    start_date,
    department_name,
    end_date
) VALUES
    (1, DATE '2026-04-01', '経営', NULL),
    (2, DATE '2026-04-01', '営業', DATE '2026-04-30'),
    (2, DATE '2026-05-01', 'AI推進部', DATE '2026-05-31'),
    (2, DATE '2026-06-01', 'DX推進部', NULL),
    (3, DATE '2026-04-01', '開発１室', DATE '2026-04-30'),
    (3, DATE '2026-05-01', 'A社開発室', DATE '2026-05-31'),
    (3, DATE '2026-06-01', 'A社保守部', DATE '2026-06-30'),
    (4, DATE '2026-04-01', 'B社開発室', DATE '2026-4-30'),
    (4, DATE '2026-05-01', 'C社開発室', DATE '2026-10-31'),
    (4, DATE '2026-11-01', 'D社開発室', NULL);
COMMIT;
