SET client_encoding = 'UTF8';

-- =====================================================================
-- テスト用マスタデータ
-- 対象テーブル:
--   position
--
-- 前提:
--   schema.sqlを先に実行すること。
-- =====================================================================

BEGIN;
DELETE FROM position;
INSERT INTO position (
    position_id,
    start_date,
    position_name,
    position_allowance,
    end_date
) VALUES
    (1, DATE '2026-04-01', '部長', 50000, NULL),
    (2, DATE '2026-04-01', '副部長', 30000, DATE '2026-04-30'),
    (2, DATE '2026-05-01', '副部長', 35000, NULL),
    (3, DATE '2026-04-01', '課長', 20000, DATE '2026-05-31'),
    (3, DATE '2026-06-01', '課長', 25000, DATE '2026-06-30'),
    (3, DATE '2026-07-01', '課長', 30000, NULL),
    (4, DATE '2026-04-01', '係長', 10000, DATE '2026-04-30'),
    (4, DATE '2026-05-01', '課長代理', 10000, NULL);
COMMIT;